import re
#kruti_uni_dict={'ñ': '॰', 'Q+Z': 'QZ+', 'sas': 'sa', 'aa': 'a', ')Z': 'र्द्ध', 'ZZ': 'Z', '‘': '"', '’': '"', '“': "'", '”': "'", 'å': '०', 'ƒ': '१', '„': '२', '…': '३', '†': '४', '‡': '५', 'ˆ': '६', '‰': '७', 'Š': '८', '‹': '९', '¶+': 'फ़्', 'd+': 'क़', '[+k': 'ख़', '[+': 'ख़्', 'x+': 'ग़', 'T+': 'ज़्', 't+': 'ज़', 'M+': 'ड़', '<+': 'ढ़', 'Q+': 'फ़', ';+': 'य़', 'j+': 'ऱ', 'u+': 'ऩ', 'Ùk': 'त्त', 'Ù': 'त्त्', 'ä': 'क्त', '–': 'दृ', '—': 'कृ', 'é': 'न्न', '™': 'न्न्', '=kk': '=k', 'f=k': 'f=', 'à': 'ह्न', 'á': 'ह्य', 'â': 'हृ', 'ã': 'ह्म', 'ºz': 'ह्र', 'º': 'ह्', 'í': 'द्द', '{k': 'क्ष', '{': 'क्ष्', '=': 'त्र', '«': 'त्र्', 'Nî': 'छ्य', 'Vî': 'ट्य', 'Bî': 'ठ्य', 'Mî': 'ड्य', '<î': 'ढ्य', '|': 'द्य', 'K': 'ज्ञ', '}': 'द्व', 'J': 'श्र', 'Vª': 'ट्र', 'Mª': 'ड्र', '<ªª': 'ढ्र', 'Nª': 'छ्र', 'Ø': 'क्र', 'Ý': 'फ्र', 'nzZ': 'र्द्र', 'æ': 'द्र', 'ç': 'प्र', 'Á': 'प्र', 'xz': 'ग्र', '#': 'रु', ':': 'रू', 'vkW': 'ऑ', 'vks': 'ओ', 'vkS': 'औ', 'vk': 'आ', 'v': 'अ', 'b±': 'ईं', 'Ã': 'ई', 'bZ': 'ई', 'b': 'इ', 'm': 'उ', 'Å': 'ऊ', ',s': 'ऐ', ',': 'ए', '_': 'ऋ', 'ô': 'क्क', 'd': 'क', 'Dk': 'क', 'D': 'क्', '[k': 'ख', '[': 'ख्', 'x': 'ग', 'Xk': 'ग', 'X': 'ग्', 'Ä': 'घ', '?k': 'घ', '?': 'घ्', '³': 'ङ', 'pkS': 'चै', 'p': 'च', 'Pk': 'च', 'P': 'च्', 'N': 'छ', 't': 'ज', 'Tk': 'ज', 'T': 'ज्', '>': 'झ', '÷': 'झ्', '¥': 'ञ', 'ê': 'ट्ट', 'ë': 'ट्ठ', 'V': 'ट', 'B': 'ठ', 'ì': 'ड्ड', 'ï': 'ड्ढ', 'M': 'ड', '<': 'ढ', '.k': 'ण', '.': 'ण्', 'r': 'त', 'Rk': 'त', 'R': 'त्', 'Fk': 'थ', 'F': 'थ्', ')': 'द्ध', 'n': 'द', '/k': 'ध', 'èk': 'ध', '/': 'ध्', 'Ë': 'ध्', 'è': 'ध्', 'u': 'न', 'Uk': 'न', 'U': 'न्', 'i': 'प', 'Ik': 'प', 'I': 'प्', 'Q': 'फ', '¶': 'फ्', 'c': 'ब', 'Ck': 'ब', 'C': 'ब्', 'Hk': 'भ', 'H': 'भ्', 'e': 'म', 'Ek': 'म', 'E': 'म्', ';': 'य', '¸': 'य्', 'j': 'र', 'y': 'ल', 'Yk': 'ल', 'Y': 'ल्', 'G': 'ळ', 'o': 'व', 'Ok': 'व', 'O': 'व्', "'k": 'श', "'": 'श्', '"k': 'ष', '"': 'ष्', 'l': 'स', 'Lk': 'स', 'L': 'स्', 'g': 'ह', 'È': 'ीं', 'z': '्र', 'Ì': 'द्द', 'Í': 'ट्ट', 'Î': 'ट्ठ', 'Ï': 'ड्ड', 'Ñ': 'कृ', 'Ò': 'भ', 'Ó': '्य', 'Ô': 'ड्ढ', 'Ö': 'झ्', 'Ük': 'श', 'Ü': 'श्', '‚': 'ॉ', 'ks': 'ो', 'kS': 'ौ', 'k': 'ा', 'h': 'ी', 'q': 'ु', 'w': 'ू', '`': 'ृ', 's': 'े', 'S': 'ै', 'a': 'ं', '¡': 'ँ', '%': 'ः', 'W': 'ॅ', '•': 'ऽ', '·': 'ऽ', '∙': 'ऽ', '~j': '्र', '~': '्', '\\': '?', '+': '़', ' ः': ':', '^': '‘', '*': '’', 'Þ': '“', 'ß': '”', '(': ';', '¼': '(', '½': ')', '¿': '{', 'À': '}', '¾': '=', 'A': '।', '-': '.', '&': '-', 'Œ': '॰', ']': ',', '~ ': '् ', '@': '/'}
kruti_list=['ñ', 'Q+Z', 'sas', 'aa', ')Z', 'ZZ', '‘', '’', '“', '”', 'å', 'ƒ', '„', '…', '†', '‡', 'ˆ', '‰', 'Š', '‹', '¶+', 'd+', '[+k', '[+', 'x+', 'T+', 't+', 'M+', '<+', 'Q+', ';+', 'j+', 'u+', 'Ùk', 'Ù', 'ä', '–', '—', 'é', '™', '=kk', 'f=k', 'à', 'á', 'â', 'ã', 'ºz', 'º', 'í', '{k', '{', '=', '«', 'Nî', 'Vî', 'Bî', 'Mî', '<î', '|', 'K', '}', 'J', 'Vª', 'Mª', '<ªª', 'Nª', 'Ø', 'Ý', 'nzZ', 'æ', 'ç', 'Á', 'xz', '#', ':', 'vkW', 'vks', 'vkS', 'vk', 'v', 'b±', 'Ã', 'bZ', 'b', 'm', 'Å', ',s', ',', '_', 'ô', 'd', 'Dk', 'D', '[k', '[', 'x', 'Xk', 'X', 'Ä', '?k', '?', '³', 'pkS', 'p', 'Pk', 'P', 'N', 't', 'Tk', 'T', '>', '÷', '¥', 'ê', 'ë', 'V', 'B', 'ì', 'ï', 'M', '<', '.k', '.', 'r', 'Rk', 'R', 'Fk', 'F', ')', 'n', '/k', 'èk', '/', 'Ë', 'è', 'u', 'Uk', 'U', 'i', 'Ik', 'I', 'Q', '¶', 'c', 'Ck', 'C', 'Hk', 'H', 'e', 'Ek', 'E', ';', '¸', 'j', 'y', 'Yk', 'Y', 'G', 'o', 'Ok', 'O', "'k", "'", '"k', '"', 'l', 'Lk', 'L', 'g', 'È', 'z', 'Ì', 'Í', 'Î', 'Ï', 'Ñ', 'Ò', 'Ó', 'Ô', 'Ö', 'Ük', 'Ü', '‚', 'ks', 'kS', 'k', 'h', 'q', 'w', '`', 's', 'S', 'a', '¡', '%', 'W', '•', '·', '∙', '~j', '~', '\\', '+', ' ः', '^', '*', 'Þ', 'ß', '(', '¼', '½', '¿', 'À', '¾', 'A', '-', '&', 'Œ', ']', '~ ', '@']
kruti_values=['॰', 'QZ+', 'sa', 'a', 'र्द्ध', 'Z', '"', '"', "'", "'", '०', '१', '२', '३', '४', '५', '६', '७', '८', '९', 'फ़्', 'क़', 'ख़', 'ख़्', 'ग़', 'ज़्', 'ज़', 'ड़', 'ढ़', 'फ़', 'य़', 'ऱ', 'ऩ', 'त्त', 'त्त्', 'क्त', 'दृ', 'कृ', 'न्न', 'न्न्', '=k', 'f=', 'ह्न', 'ह्य', 'हृ', 'ह्म', 'ह्र', 'ह्', 'द्द', 'क्ष', 'क्ष्', 'त्र', 'त्र्', 'छ्य', 'ट्य', 'ठ्य', 'ड्य', 'ढ्य', 'द्य', 'ज्ञ', 'द्व', 'श्र', 'ट्र', 'ड्र', 'ढ्र', 'छ्र', 'क्र', 'फ्र', 'र्द्र', 'द्र', 'प्र', 'प्र', 'ग्र', 'रु', 'रू', 'ऑ', 'ओ', 'औ', 'आ', 'अ', 'ईं', 'ई', 'ई', 'इ', 'उ', 'ऊ', 'ऐ', 'ए', 'ऋ', 'क्क', 'क', 'क', 'क्', 'ख', 'ख्', 'ग', 'ग', 'ग्', 'घ', 'घ', 'घ्', 'ङ', 'चै', 'च', 'च', 'च्', 'छ', 'ज', 'ज', 'ज्', 'झ', 'झ्', 'ञ', 'ट्ट', 'ट्ठ', 'ट', 'ठ', 'ड्ड', 'ड्ढ', 'ड', 'ढ', 'ण', 'ण्', 'त', 'त', 'त्', 'थ', 'थ्', 'द्ध', 'द', 'ध', 'ध', 'ध्', 'ध्', 'ध्', 'न', 'न', 'न्', 'प', 'प', 'प्', 'फ', 'फ्', 'ब', 'ब', 'ब्', 'भ', 'भ्', 'म', 'म', 'म्', 'य', 'य्', 'र', 'ल', 'ल', 'ल्', 'ळ', 'व', 'व', 'व्', 'श', 'श्', 'ष', 'ष्', 'स', 'स', 'स्', 'ह', 'ीं', '्र', 'द्द', 'ट्ट', 'ट्ठ', 'ड्ड', 'कृ', 'भ', '्य', 'ड्ढ', 'झ्', 'श', 'श्', 'ॉ', 'ो', 'ौ', 'ा', 'ी', 'ु', 'ू', 'ृ', 'े', 'ै', 'ं', 'ँ', 'ः', 'ॅ', 'ऽ', 'ऽ', 'ऽ', '्र', '्', '?', '़', ':', '‘', '’', '“', '”', ';', '(', ')', '{', '}', '=', '।', '.', '-', '॰', ',', '् ', '/']
modifierlist=['अ', 'आ', 'इ', 'ई', 'उ', 'ऊ', 'ए', 'ऐ', 'ओ', 'औ', 'ा', 'िं','ी', 'ु', 'ू', 'ृ', 'े', 'ै', 'ो', 'ौ', 'ं', 'ः', 'ँ', 'ॅ']


def kruti_to_utf8(instring):
    for i in range(len(kruti_list)):
        try:
            instring=re.sub(re.escape(kruti_list[i]),kruti_values[i],instring)
        except Exception as e:
            print(e)
    instring=''.join(instring)
    instring=re.sub('±' , "Zं",instring)
    instring=re.sub('Æ',"र्f",instring)
    f_arr=[]
    for i in range(len(instring)):
        if(instring[i]=='f'):
            f_arr.append(i)
    instring=list(instring)
    for k in f_arr:
        instring[k]=instring[k+1]
        instring[k+1]='ि'
    instring=''.join(instring)
    instring=re.sub('Ç' , "fa",instring)
    instring=re.sub('É' , "र्fa",instring)
    f_arr=[]
    for i in range(len(instring)):
        if(instring[i:i+2]=='fa'):
            f_arr.append(i)
            i=i+1
    f_arr.reverse()
    instring=list(instring)
    for k in f_arr:
        instring[k]=instring[k+2]
        instring[k+1]='ि'
        instring.pop(k+2)
    instring=''.join(instring)
    instring=re.sub('Ê' , "ीZ",instring)
    f_arr=[]
    for i in range(len(instring)):
        if(instring[i:i+2]=='ि्'):
            f_arr.append(i)
            i=i+1
    f_arr.reverse()
    instring=list(instring)
    for k in f_arr:
        instring[k]='्'
        instring[k+1]=instring[k+2]
        instring[k+2]='ि'
    instring=''.join(instring)
    try:
        rpos=instring.index('Z')
    except ValueError:
        rpos=-1
    while(rpos>0):
        pphr=rpos-1
        char=instring[pphr]
        while(char in modifierlist):
            pphr=pphr-1
            char=instring[pphr]
        if(pphr>rpos-pphr):
            str_to_replace=instring[pphr:rpos-pphr]
        else:
            str_to_replace=instring[rpos-pphr:pphr]
        rep_str="र्" + str_to_replace
        str_to_replace = str_to_replace + "Z"
        instring=re.sub(re.escape(str_to_replace),rep_str,instring)
        try:
            rpos=instring.index('Z')
        except ValueError:
            rpos=-1
    return instring